### *Here we  impliment mean, median and mode imputation technique and clean the dataset which is raw data to clean data* 

- *import raw dataset* 
- *read dataset* 
- *check numerical  missing values*
- *fill  numerical missing values*  
- *check categorical missing values* 
- *fill categorical missing values*
- *change dataset type Excel to csv*
- *saved dataset  cleandataset.csv*

In [989]:
# import libraries

import pandas as pd 
import numpy as np

In [990]:
# here importor load  Raw dataset 
data = pd.read_excel(r"C:\Users\DELL\Notes_and_practice\EDA\Rawdata.xlsx")
data

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [991]:
# here we how many column in the datasheet 
data.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [992]:
# here we check top 3 rows
data.head(3)

     Name          Domain       Age   Location   Salary     Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0      2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000      <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000  4> yrs

In [993]:
# here we check bottom 3 rows in the dataset
data.tail(3)

     Name       Domain    Age  Location   Salary      Exp
3    Jane  Ana^^lytics    NaN  Hyderbad   2000^0      NaN
4  Uttam*   Statistics  67-yr       NaN   30000-  5+ year
5     Kim          NLP   55yr     Delhi  6000^$0      10+

In [994]:
# here we check data length  how many row and columns (shape)
data.shape

(6, 6)

## *Data cleaning and data cleansing*

In [995]:
# check dataset info 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [996]:
data

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [997]:
# check missing values in entire dataset
data.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [998]:
data.isna()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [999]:
# here we check all column missing values 
data.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [1000]:
data.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

- *we remove regular expression in categorical datatype like Name column*

In [1001]:
data["Name"]

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [1002]:
# here we treat regular expressions 
data['Name']= data['Name'].str.replace('[^a-zA-Z]','',regex=True)

In [1003]:
# check onely Name column
data['Name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: Name, dtype: object

In [1004]:
 # next Domain column
data['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [1005]:
 #we treat or clean regular expressions in the Domain column 
data['Domain']=data['Domain'].str.replace('[^a-zA-Z]','',regex=True)

In [1006]:
data['Domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: Domain, dtype: object

In [1007]:
data

    Name       Domain       Age   Location   Salary      Exp
0   Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy      Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics     67-yr        NaN   30000-  5+ year
5    Kim          NLP      55yr      Delhi  6000^$0      10+

- *here we check categorical missing values and fill missing values*

In [1008]:
data["Location"].isnull()

0    False
1    False
2     True
3    False
4     True
5    False
Name: Location, dtype: bool

In [1009]:
data["Location"]

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [1010]:
data["Location"].fillna(data['Location'].mode()[0],inplace=True)

In [1011]:
data["Location"]

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [1012]:
data

    Name       Domain       Age   Location   Salary      Exp
0   Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy      Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst       NaN  Bangalore  1$5%000   4> yrs
3   Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics     67-yr  Bangalore   30000-  5+ year
5    Kim          NLP      55yr      Delhi  6000^$0      10+

-  *first we remove all regular expression in  the numerical column and check misssing values and then we fill missing velues*

In [1013]:
data["Age"]

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [1014]:
# here we remove reular exp
data["Age"]=data["Age"].str.extract('(\d+)')

<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
C:\Users\DELL\AppData\Local\Temp\ipykernel_9952\2379431942.py:2: SyntaxWarning: invalid escape sequence '\d'
  data["Age"]=data["Age"].str.extract('(\d+)')

In [1015]:

data["Age"]

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [1016]:
data['Age'] = pd.to_numeric(data['Age'], errors='coerce')

In [1017]:
# fill misssing values using mean
data['Age'].fillna(data['Age'].mean(), inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_9952\2456832442.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].mean(), inplace=True)

In [1018]:
# convert to dtype float to int
data['Age'] = data['Age'].round().astype(int)

- *sucessfully cleaned age column*

In [1019]:
# again check
data

    Name       Domain  Age   Location   Salary      Exp
0   Mike  Datascience   34     Mumbai   5^00#0       2+
1  Teddy      Testing   45  Bangalore  10%%000       <3
2   Umar  Dataanalyst   50  Bangalore  1$5%000   4> yrs
3   Jane    Analytics   50   Hyderbad   2000^0      NaN
4  Uttam   Statistics   67  Bangalore   30000-  5+ year
5    Kim          NLP   55      Delhi  6000^$0      10+

- *next salary column*

In [ ]:

data['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [ ]:
# remove regular expession
data['Salary']=data['Salary'].str.replace('[^0-9]','',regex=True)

In [1022]:
data['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: object

- *succesfully clean salary column*

- *next Exprience column*

In [1023]:
data['Exp']

0         2+
1         <3
2     4> yrs
3        NaN
4    5+ year
5        10+
Name: Exp, dtype: object

In [ ]:
 # treat regular expression
data['Exp']=data['Exp'].str.replace('[^0-9]','',regex=True)

In [1025]:
data["Exp"]

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [ ]:
# Change datatype
data['Exp'] = pd.to_numeric(data['Exp'], errors='coerce')

In [ ]:
# fill missing values
data['Exp'].fillna(data['Exp'].mean(), inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_9952\987799321.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Exp'].fillna(data['Exp'].mean(), inplace=True)

In [1029]:
data['Exp']

0     2.0
1     3.0
2     4.0
3     4.8
4     5.0
5    10.0
Name: Exp, dtype: float64

In [ ]:
#type change like float to int
data['Exp']=data['Exp'].round().astype(int)

In [1032]:
data['Exp']

0     2
1     3
2     4
3     5
4     5
5    10
Name: Exp, dtype: int32

- *finnaly exprience column we clean* 


### and this is our clean data

In [1033]:
data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst   50  Bangalore  15000    4
3   Jane    Analytics   50   Hyderbad  20000    5
4  Uttam   Statistics   67  Bangalore  30000    5
5    Kim          NLP   55      Delhi  60000   10

### *Next step  export our clean  dataset*

In [1035]:
import os
os.getcwd()

'c:\\Users\\DELL\\Notes_and_practice\\EDA'

In [1036]:
data.to_csv("cleaned_data.csv", index=False)